ChartsOfCharacteristicTypes/бит_НастройкиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>бит_НастройкиЗагрузки</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
				<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
				<v8:StringQualifiers>
					<v8:Length>255</v8:Length>
				</v8:StringQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

InformationRegisters/бит_ЗначенияНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗначенияНастроек</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_НастройкиЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfCharacteristicTypes/бит_НастройкиЗагрузки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ИмяПредопределенныхДанных = "ИмяФайлаЗагрузки" тогда
		КвалификаторыСтроки = Новый КвалификаторыСтроки(255);
		ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
		Элементы.Значение.ОграничениеТипа =  ОписаниеТипаСтрока;
	ИначеЕсли Объект.ИмяПредопределенныхДанных = "Пароль" тогда
		Элементы.Значение.РежимПароля = Истина;	
	Иначе 
		Элементы.Значение.ОграничениеТипа = Объект.ТипЗначения;
		Объект.ТипЗначения.ПривестиЗначение(Значение);
	КонецЕсли;
	Значение = ПланыВидовХарактеристик.бит_НастройкиЗагрузки.ЗначениеНастройки(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МенеджерЗаписи = РегистрыСведений.бит_ЗначенияНастроек.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Настройка = Объект.Ссылка;
	МенеджерЗаписи.Значение = Значение;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ИмяПредопределенныхДанных = "ИмяФайлаЗагрузки" тогда
		ОбработатьНачалоВыбораФайла(СтандартнаяОбработка);
	ИначеЕсли Объект.ИмяПредопределенныхДанных = "ГруппаКонтрагентов" тогда
		

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораФайла(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = Нстр("ru = 'Задайте имя файла загрузки из qMS'");
	ДиалогВыбораФайла.ПолноеИмяФайла =  Значение;
	
	ДиалогВыбораФайла.Фильтр = "Формат выгрузки(*.xml)|*.xml";
	Если ДиалогВыбораФайла.Выбрать() Тогда
			Значение = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	Если Объект.ИмяПредопределенныхДанных = "ИмяФайлаЗагрузки" тогда
		ОткрытьВПриложении(Элемент, "ИмяФайлаЗагрузки", СтандартнаяОбработка); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВПриложении(Элемент, ПутьКДанным, СтандартнаяОбработка)

	Файл = Новый Файл(Элемент.ТекстРедактирования); 	
	Если Файл.Существует() Тогда   		
		ЗапуститьПриложение(Элемент.ТекстРедактирования);		
	Иначе 		
		СообщитьПользователю(Нстр("ru = 'Файл не найден'"), ПутьКДанным); 		
	КонецЕсли; 	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьПользователю(Текст, ПутьКДанным = "")
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.ПутьКДанным = ПутьКДанным;
	Сообщение.Сообщить();
	
КонецПроцедуры
